Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.ShearAreaWeakAxis
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.ShearAreaStrongAxis
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.WarpingConstant
Warping constant (Cw, Iomega, H)
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.TorsionalModulus
Section modulus for calculations of torsion stresses (Ct)
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.TorsionalMomentOfInertia
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.PlasticModulusWeakAxis
Plastic section modulus in bending about main weak axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.PlasticModulusStrongAxis
Plastic section modulus in bending about main strong axis (Z, Wpl)
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.ElasticModulusWeakAxis
Elastic section modulus about main weak axis for calculation of bending stresses.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.ElasticModulusStrongAxis
Elastic section modulus about main strong axis for calculation of bending stresses.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.MomentOfInertiaWeakAxis
Moment of Inertia about main weak axis (I).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.MomentOfInertiaStrongAxis
Moment of Inertia about main strong axis (I).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.NominalWeight
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.Perimeter
Painting surface of the unit length.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.SectionArea
Cross section area.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.PrincipalAxesAngle
Rotation angle between the principal axes and cross section reference planes.
Since:
2015